Revit 2026 API

# ConnectorSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectorSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
ConnectorSetIterator()
```
```fsharp
new : unit -> ConnectorSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ConnectorSetIterator Class

Autodesk.Revit.DB Namespace